#+title: eduardo's website title
#+bibliography: ./refs.bib
#+options: broken-links:mark toc:nil
#+hugo_base_dir: ../
#+hugo_paired_shortcodes: alert image
#+author: Eduardo Bellani

*** On capacity planning

In order to be able to efficiently modify transfers and run the
constraints needed to keep transactions consistent with the business
rules we should keep in the working set 2 days of
transfers/transactions. The number 2 is chosen because wire transfers
typically settle within one business day and while international
transfers take one to five days, with most completing within
two[cite:@paystand_wire_transfer_time] we.

Taking ~finance.transfer~ as a reference (the widest row), we estimate
the per-row size (ignoring alignment[cite:@thomas2018rocksandsand]):

| Name                        | Type        | Size (bytes) |
|-----------------------------+-------------+--------------|
| transfer_period             | tstzrange   |           32 |
| transfer_created_at         | timestamptz |            8 |
| account_number              | text(12)    |           13 |
| routing_number              | text(9)     |           10 |
| counterparty_account_number | text(12)    |           13 |
| counterparty_routing_number | text(9)     |           10 |
| amount                      | bigint      |            8 |
| status                      | text(10)    |           11 |
| sys_period                  | tstzrange   |           32 |
|-----------------------------+-------------+--------------|
| Total (plus 24 row header)  |             |          161 |
#+TBLFM: @>$>=vsum(@I..@II)+24

So roughly 160 bytes per row. The log tables have the same width. The
transaction tables are slightly narrower (no ~transfer_period~, no
~status~), around 120 bytes per row.

**** Working set estimation

The working set is the data that must be in ~shared_buffers~ for the
system to perform well. As stated above, the working set will consist of
2 days of transfers transactions.

Let's assume that a transfer row corresponds to 2 rows in
~transfer_status_log~ (the initial insert plus a state change) and 3
transactions (2 pending transactions and a settled transaction). That
gives us 3 transfer like rows + 3 transaction rows.

Each index entry carries ~8 bytes of overhead plus the indexed
data[cite:@StackOverflowAlbe2020indexsize]. In our design, most tables
have one index: the B-tree backing the primary key (the temporal table
has 2, but lets ignore that for the sake of simplicity). The primary key
for ~finance.transfer~ indexes 5 columns totalling ~54 bytes, so each
index entry is ~62 bytes. This amounts to roughly 40% of the row
size. So, a safe rule of thumb: add a 1.4 multiplier to the table sizes
to account for for index overhead.

This whole argument boils down to the byte sum of:

#+name: daily_size
#+begin_src calc :exports both
  ((3 * 160) + (3 * 120)) * 1.4
#+end_src

#+results: daily_size
: 1176.


| Scale                                  | Transfers/day | Working set size for 2 days |
|----------------------------------------+---------------+-----------------------------|
| Startup                                | 10,000        | 22M                         |
| Mid/large bank[cite:@nubank2022pix]    | 50,000,000    | 110G                        |
| Global processor[cite:@visa2025annual] | 900,000,000   | 1.9T                        |
#+TBLFM: $3='(file-size-human-readable (string-to-number (calc-eval (format "2 * (%s * %s)" (string-replace "," "" $2) (org-sbe daily_size)))))

Up to a mid level bank one can fit the working set comfortably in modern
cloud database servers. AWS RDS, for instance, supports up to 4TiB of
memory per instance for PostgreSQL-compatible
instances[cite:@aws_rds_instance_types].

